import { javascript, typescript, react, nodejs, flask, mysql } from "@/assets/images";

const stackInfoList = [
  {
    name: "프론트엔드",
    stackList: [
      {
        stack: "JavaScript",
        img: javascript,
        description: {
          title: "ES6 문법을 이해하고 있으며, 비동기 처리 등 다양한 자바스크립트 문법 사용에 익숙합니다.",
          text: [
            "읽기 편한 코드와 성능이 좋은 코드 중에서 항상 고민합니다.",
            "프론트엔드 성능 최적화에도 관심이 많아 관련 글이나 개발자 도구도 자주 들여다보곤 합니다.",
            "함수형 프로그래밍에는 아직 익숙하지 않지만, 필요하다면 언제든 배울 준비가 되어 있습니다.",
          ],
        },
      },
      {
        stack: "TypeScript",
        img: typescript,
        description: [
          {
            title: "ES6 문법을 이해하고 있으며, 비동기 처리 등 다양한 자바스크립트 문법 사용에 익숙합니다.",
            text: [
              "읽기 편한 코드와 성능이 좋은 코드 중에서 항상 고민합니다.",
              "프론트엔드 성능 최적화에도 관심이 많아 관련 글이나 개발자 도구도 자주 들여다보곤 합니다.",
              "함수형 프로그래밍에는 아직 익숙하지 않지만, 필요하다면 언제든 배울 준비가 되어 있습니다.",
            ],
          },
        ],
      },
      {
        stack: "React",
        img: react,
        description: [
          {
            title: "ES6 문법을 이해하고 있으며, 비동기 처리 등 다양한 자바스크립트 문법 사용에 익숙합니다.",
            text: [
              "읽기 편한 코드와 성능이 좋은 코드 중에서 항상 고민합니다.",
              "프론트엔드 성능 최적화에도 관심이 많아 관련 글이나 개발자 도구도 자주 들여다보곤 합니다.",
              "함수형 프로그래밍에는 아직 익숙하지 않지만, 필요하다면 언제든 배울 준비가 되어 있습니다.",
            ],
          },
        ],
      },
    ],
  },
  {
    name: "백엔드",
    stackList: [
      {
        stack: "NodeJS",
        img: nodejs,
        description: [
          {
            title: "ES6 문법을 이해하고 있으며, 비동기 처리 등 다양한 자바스크립트 문법 사용에 익숙합니다.",
            text: [
              "읽기 편한 코드와 성능이 좋은 코드 중에서 항상 고민합니다.",
              "프론트엔드 성능 최적화에도 관심이 많아 관련 글이나 개발자 도구도 자주 들여다보곤 합니다.",
              "함수형 프로그래밍에는 아직 익숙하지 않지만, 필요하다면 언제든 배울 준비가 되어 있습니다.",
            ],
          },
        ],
      },
      {
        stack: "Flask",
        img: flask,
        description: [
          {
            title: "ES6 문법을 이해하고 있으며, 비동기 처리 등 다양한 자바스크립트 문법 사용에 익숙합니다.",
            text: [
              "읽기 편한 코드와 성능이 좋은 코드 중에서 항상 고민합니다.",
              "프론트엔드 성능 최적화에도 관심이 많아 관련 글이나 개발자 도구도 자주 들여다보곤 합니다.",
              "함수형 프로그래밍에는 아직 익숙하지 않지만, 필요하다면 언제든 배울 준비가 되어 있습니다.",
            ],
          },
        ],
      },
    ],
  },
];

export { stackInfoList };
